starter-kit-bindings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Bindings</title>
<!-- 2014-10-13 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Bindings</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Bindings</h2>
<div class="outline-text-2" id="text-1">
<p>
Key Bindings.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">You know, like Readline.</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-M-h"</span>) 'backward-kill-word)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Align your code in a pretty way.</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-x \\"</span>) 'align-regexp)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Completion that uses many different methods to find options.</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"M-/"</span>) 'hippie-expand)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Turn on the menu bar for exploring new modes</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key [f1] 'menu-bar-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Font size</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key global-map (kbd <span style="font-style: italic;">"C-+"</span>) 'text-scale-increase)
(define-key global-map (kbd <span style="font-style: italic;">"C--"</span>) 'text-scale-decrease)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Use regex searches by default.</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-s"</span>) 'isearch-forward-regexp)
(global-set-key (kbd <span style="font-style: italic;">"\C-r"</span>) 'isearch-backward-regexp)
(global-set-key (kbd <span style="font-style: italic;">"C-M-s"</span>) 'isearch-forward)
(global-set-key (kbd <span style="font-style: italic;">"C-M-r"</span>) 'isearch-backward)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">File finding</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-x M-f"</span>) 'ido-find-file-other-window)
(global-set-key (kbd <span style="font-style: italic;">"C-x C-p"</span>) 'find-file-at-point)
(global-set-key (kbd <span style="font-style: italic;">"C-c y"</span>) 'bury-buffer)
(global-set-key (kbd <span style="font-style: italic;">"C-c r"</span>) 'revert-buffer)
(global-set-key (kbd <span style="font-style: italic;">"M-`"</span>) 'file-cache-minibuffer-complete)
(global-set-key (kbd <span style="font-style: italic;">"C-x C-b"</span>) 'ibuffer)
(global-set-key (kbd <span style="font-style: italic;">"C-x f"</span>) 'recentf-ido-find-file)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">Window switching. (C-x o goes to the next window)</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(windmove-default-keybindings) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Shift+direction</span>
(global-set-key (kbd <span style="font-style: italic;">"C-x O"</span>) (<span style="font-weight: bold;">lambda</span> () (interactive) (other-window -1))) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">back one</span>
(global-set-key (kbd <span style="font-style: italic;">"C-x C-o"</span>) (<span style="font-weight: bold;">lambda</span> () (interactive) (other-window 2))) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">forward two</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">Indentation help</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-x ^"</span>) 'join-line)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">If you want to be able to M-x without meta</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-x C-m"</span>) 'execute-extended-command)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">Help should search more than just commands</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-h a"</span>) 'apropos)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12">Activate occur easily inside isearch</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key isearch-mode-map (kbd <span style="font-style: italic;">"C-o"</span>)
  (<span style="font-weight: bold;">lambda</span> () (interactive)
    (<span style="font-weight: bold;">let</span> ((case-fold-search isearch-case-fold-search))
      (occur (<span style="font-weight: bold;">if</span> isearch-regexp
                 isearch-string
               (regexp-quote isearch-string))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13">Org-mode</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Two global binding for Org-mode (see <a href="starter-kit-org.html">starter-kit-org</a>)
</p>

<p>
The <a href="http://orgmode.org/manual/Agenda-Views.html#Agenda-Views">Org-mode agenda</a> is good to have close at hand
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key global-map <span style="font-style: italic;">"\C-ca"</span> 'org-agenda)
</pre>
</div>

<p>
Org-mode supports <a href="http://orgmode.org/manual/Hyperlinks.html#Hyperlinks">links</a>, this command allows you to store links
globally for later insertion into an Org-mode buffer.  See
<a href="http://orgmode.org/manual/Handling-links.html#Handling-links">Handling-links</a> in the Org-mode manual.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key global-map <span style="font-style: italic;">"\C-cl"</span> 'org-store-link)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14">Rgrep</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Rgrep is infinitely useful in multi-file projects.
</p>

<p>
(see <a href="(describe-function 'rgrep)">(describe-function 'rgrep)</a>)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key global-map <span style="font-style: italic;">"\C-x\C-r"</span> 'rgrep)
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
